/* eslint-disable */
var cityData = [
  [{
    "text": "市辖区",
    "value": "1101"
  }],
  [{
    "text": "市辖区",
    "value": "1201"
  }],
  [{
      "text": "石家庄市",
      "value": "1301"
    },
    {
      "text": "唐山市",
      "value": "1302"
    },
    {
      "text": "秦皇岛市",
      "value": "1303"
    },
    {
      "text": "邯郸市",
      "value": "1304"
    },
    {
      "text": "邢台市",
      "value": "1305"
    },
    {
      "text": "保定市",
      "value": "1306"
    },
    {
      "text": "张家口市",
      "value": "1307"
    },
    {
      "text": "承德市",
      "value": "1308"
    },
    {
      "text": "沧州市",
      "value": "1309"
    },
    {
      "text": "廊坊市",
      "value": "1310"
    },
    {
      "text": "衡水市",
      "value": "1311"
    }
  ],
  [{
      "text": "太原市",
      "value": "1401"
    },
    {
      "text": "大同市",
      "value": "1402"
    },
    {
      "text": "阳泉市",
      "value": "1403"
    },
    {
      "text": "长治市",
      "value": "1404"
    },
    {
      "text": "晋城市",
      "value": "1405"
    },
    {
      "text": "朔州市",
      "value": "1406"
    },
    {
      "text": "晋中市",
      "value": "1407"
    },
    {
      "text": "运城市",
      "value": "1408"
    },
    {
      "text": "忻州市",
      "value": "1409"
    },
    {
      "text": "临汾市",
      "value": "1410"
    },
    {
      "text": "吕梁市",
      "value": "1411"
    }
  ],
  [{
      "text": "呼和浩特市",
      "value": "1501"
    },
    {
      "text": "包头市",
      "value": "1502"
    },
    {
      "text": "乌海市",
      "value": "1503"
    },
    {
      "text": "赤峰市",
      "value": "1504"
    },
    {
      "text": "通辽市",
      "value": "1505"
    },
    {
      "text": "鄂尔多斯市",
      "value": "1506"
    },
    {
      "text": "呼伦贝尔市",
      "value": "1507"
    },
    {
      "text": "巴彦淖尔市",
      "value": "1508"
    },
    {
      "text": "乌兰察布市",
      "value": "1509"
    },
    {
      "text": "兴安盟",
      "value": "1522"
    },
    {
      "text": "锡林郭勒盟",
      "value": "1525"
    },
    {
      "text": "阿拉善盟",
      "value": "1529"
    }
  ],
  [{
      "text": "沈阳市",
      "value": "2101"
    },
    {
      "text": "大连市",
      "value": "2102"
    },
    {
      "text": "鞍山市",
      "value": "2103"
    },
    {
      "text": "抚顺市",
      "value": "2104"
    },
    {
      "text": "本溪市",
      "value": "2105"
    },
    {
      "text": "丹东市",
      "value": "2106"
    },
    {
      "text": "锦州市",
      "value": "2107"
    },
    {
      "text": "营口市",
      "value": "2108"
    },
    {
      "text": "阜新市",
      "value": "2109"
    },
    {
      "text": "辽阳市",
      "value": "2110"
    },
    {
      "text": "盘锦市",
      "value": "2111"
    },
    {
      "text": "铁岭市",
      "value": "2112"
    },
    {
      "text": "朝阳市",
      "value": "2113"
    },
    {
      "text": "葫芦岛市",
      "value": "2114"
    }
  ],
  [{
      "text": "长春市",
      "value": "2201"
    },
    {
      "text": "吉林市",
      "value": "2202"
    },
    {
      "text": "四平市",
      "value": "2203"
    },
    {
      "text": "辽源市",
      "value": "2204"
    },
    {
      "text": "通化市",
      "value": "2205"
    },
    {
      "text": "白山市",
      "value": "2206"
    },
    {
      "text": "松原市",
      "value": "2207"
    },
    {
      "text": "白城市",
      "value": "2208"
    },
    {
      "text": "延边朝鲜族自治州",
      "value": "2224"
    }
  ],
  [{
      "text": "哈尔滨市",
      "value": "2301"
    },
    {
      "text": "齐齐哈尔市",
      "value": "2302"
    },
    {
      "text": "鸡西市",
      "value": "2303"
    },
    {
      "text": "鹤岗市",
      "value": "2304"
    },
    {
      "text": "双鸭山市",
      "value": "2305"
    },
    {
      "text": "大庆市",
      "value": "2306"
    },
    {
      "text": "伊春市",
      "value": "2307"
    },
    {
      "text": "佳木斯市",
      "value": "2308"
    },
    {
      "text": "七台河市",
      "value": "2309"
    },
    {
      "text": "牡丹江市",
      "value": "2310"
    },
    {
      "text": "黑河市",
      "value": "2311"
    },
    {
      "text": "绥化市",
      "value": "2312"
    },
    {
      "text": "大兴安岭地区",
      "value": "2327"
    }
  ],
  [{
    "text": "市辖区",
    "value": "3101"
  }],
  [{
      "text": "南京市",
      "value": "3201"
    },
    {
      "text": "无锡市",
      "value": "3202"
    },
    {
      "text": "徐州市",
      "value": "3203"
    },
    {
      "text": "常州市",
      "value": "3204"
    },
    {
      "text": "苏州市",
      "value": "3205"
    },
    {
      "text": "南通市",
      "value": "3206"
    },
    {
      "text": "连云港市",
      "value": "3207"
    },
    {
      "text": "淮安市",
      "value": "3208"
    },
    {
      "text": "盐城市",
      "value": "3209"
    },
    {
      "text": "扬州市",
      "value": "3210"
    },
    {
      "text": "镇江市",
      "value": "3211"
    },
    {
      "text": "泰州市",
      "value": "3212"
    },
    {
      "text": "宿迁市",
      "value": "3213"
    }
  ],
  [{
      "text": "杭州市",
      "value": "3301"
    },
    {
      "text": "宁波市",
      "value": "3302"
    },
    {
      "text": "温州市",
      "value": "3303"
    },
    {
      "text": "嘉兴市",
      "value": "3304"
    },
    {
      "text": "湖州市",
      "value": "3305"
    },
    {
      "text": "绍兴市",
      "value": "3306"
    },
    {
      "text": "金华市",
      "value": "3307"
    },
    {
      "text": "衢州市",
      "value": "3308"
    },
    {
      "text": "舟山市",
      "value": "3309"
    },
    {
      "text": "台州市",
      "value": "3310"
    },
    {
      "text": "丽水市",
      "value": "3311"
    }
  ],
  [{
      "text": "合肥市",
      "value": "3401"
    },
    {
      "text": "芜湖市",
      "value": "3402"
    },
    {
      "text": "蚌埠市",
      "value": "3403"
    },
    {
      "text": "淮南市",
      "value": "3404"
    },
    {
      "text": "马鞍山市",
      "value": "3405"
    },
    {
      "text": "淮北市",
      "value": "3406"
    },
    {
      "text": "铜陵市",
      "value": "3407"
    },
    {
      "text": "安庆市",
      "value": "3408"
    },
    {
      "text": "黄山市",
      "value": "3410"
    },
    {
      "text": "滁州市",
      "value": "3411"
    },
    {
      "text": "阜阳市",
      "value": "3412"
    },
    {
      "text": "宿州市",
      "value": "3413"
    },
    {
      "text": "六安市",
      "value": "3415"
    },
    {
      "text": "亳州市",
      "value": "3416"
    },
    {
      "text": "池州市",
      "value": "3417"
    },
    {
      "text": "宣城市",
      "value": "3418"
    }
  ],
  [{
      "text": "福州市",
      "value": "3501"
    },
    {
      "text": "厦门市",
      "value": "3502"
    },
    {
      "text": "莆田市",
      "value": "3503"
    },
    {
      "text": "三明市",
      "value": "3504"
    },
    {
      "text": "泉州市",
      "value": "3505"
    },
    {
      "text": "漳州市",
      "value": "3506"
    },
    {
      "text": "南平市",
      "value": "3507"
    },
    {
      "text": "龙岩市",
      "value": "3508"
    },
    {
      "text": "宁德市",
      "value": "3509"
    }
  ],
  [{
      "text": "南昌市",
      "value": "3601"
    },
    {
      "text": "景德镇市",
      "value": "3602"
    },
    {
      "text": "萍乡市",
      "value": "3603"
    },
    {
      "text": "九江市",
      "value": "3604"
    },
    {
      "text": "新余市",
      "value": "3605"
    },
    {
      "text": "鹰潭市",
      "value": "3606"
    },
    {
      "text": "赣州市",
      "value": "3607"
    },
    {
      "text": "吉安市",
      "value": "3608"
    },
    {
      "text": "宜春市",
      "value": "3609"
    },
    {
      "text": "抚州市",
      "value": "3610"
    },
    {
      "text": "上饶市",
      "value": "3611"
    }
  ],
  [{
      "text": "济南市",
      "value": "3701"
    },
    {
      "text": "青岛市",
      "value": "3702"
    },
    {
      "text": "淄博市",
      "value": "3703"
    },
    {
      "text": "枣庄市",
      "value": "3704"
    },
    {
      "text": "东营市",
      "value": "3705"
    },
    {
      "text": "烟台市",
      "value": "3706"
    },
    {
      "text": "潍坊市",
      "value": "3707"
    },
    {
      "text": "济宁市",
      "value": "3708"
    },
    {
      "text": "泰安市",
      "value": "3709"
    },
    {
      "text": "威海市",
      "value": "3710"
    },
    {
      "text": "日照市",
      "value": "3711"
    },
    {
      "text": "莱芜市",
      "value": "3712"
    },
    {
      "text": "临沂市",
      "value": "3713"
    },
    {
      "text": "德州市",
      "value": "3714"
    },
    {
      "text": "聊城市",
      "value": "3715"
    },
    {
      "text": "滨州市",
      "value": "3716"
    },
    {
      "text": "菏泽市",
      "value": "3717"
    }
  ],
  [{
      "text": "郑州市",
      "value": "4101"
    },
    {
      "text": "开封市",
      "value": "4102"
    },
    {
      "text": "洛阳市",
      "value": "4103"
    },
    {
      "text": "平顶山市",
      "value": "4104"
    },
    {
      "text": "安阳市",
      "value": "4105"
    },
    {
      "text": "鹤壁市",
      "value": "4106"
    },
    {
      "text": "新乡市",
      "value": "4107"
    },
    {
      "text": "焦作市",
      "value": "4108"
    },
    {
      "text": "濮阳市",
      "value": "4109"
    },
    {
      "text": "许昌市",
      "value": "4110"
    },
    {
      "text": "漯河市",
      "value": "4111"
    },
    {
      "text": "三门峡市",
      "value": "4112"
    },
    {
      "text": "南阳市",
      "value": "4113"
    },
    {
      "text": "商丘市",
      "value": "4114"
    },
    {
      "text": "信阳市",
      "value": "4115"
    },
    {
      "text": "周口市",
      "value": "4116"
    },
    {
      "text": "驻马店市",
      "value": "4117"
    },
    {
      "text": "省直辖县级行政区划",
      "value": "4190"
    }
  ],
  [{
      "text": "武汉市",
      "value": "4201"
    },
    {
      "text": "黄石市",
      "value": "4202"
    },
    {
      "text": "十堰市",
      "value": "4203"
    },
    {
      "text": "宜昌市",
      "value": "4205"
    },
    {
      "text": "襄阳市",
      "value": "4206"
    },
    {
      "text": "鄂州市",
      "value": "4207"
    },
    {
      "text": "荆门市",
      "value": "4208"
    },
    {
      "text": "孝感市",
      "value": "4209"
    },
    {
      "text": "荆州市",
      "value": "4210"
    },
    {
      "text": "黄冈市",
      "value": "4211"
    },
    {
      "text": "咸宁市",
      "value": "4212"
    },
    {
      "text": "随州市",
      "value": "4213"
    },
    {
      "text": "恩施土家族苗族自治州",
      "value": "4228"
    },
    {
      "text": "省直辖县级行政区划",
      "value": "4290"
    }
  ],
  [{
      "text": "长沙市",
      "value": "4301"
    },
    {
      "text": "株洲市",
      "value": "4302"
    },
    {
      "text": "湘潭市",
      "value": "4303"
    },
    {
      "text": "衡阳市",
      "value": "4304"
    },
    {
      "text": "邵阳市",
      "value": "4305"
    },
    {
      "text": "岳阳市",
      "value": "4306"
    },
    {
      "text": "常德市",
      "value": "4307"
    },
    {
      "text": "张家界市",
      "value": "4308"
    },
    {
      "text": "益阳市",
      "value": "4309"
    },
    {
      "text": "郴州市",
      "value": "4310"
    },
    {
      "text": "永州市",
      "value": "4311"
    },
    {
      "text": "怀化市",
      "value": "4312"
    },
    {
      "text": "娄底市",
      "value": "4313"
    },
    {
      "text": "湘西土家族苗族自治州",
      "value": "4331"
    }
  ],
  [{
      "text": "广州市",
      "value": "4401"
    },
    {
      "text": "韶关市",
      "value": "4402"
    },
    {
      "text": "深圳市",
      "value": "4403"
    },
    {
      "text": "珠海市",
      "value": "4404"
    },
    {
      "text": "汕头市",
      "value": "4405"
    },
    {
      "text": "佛山市",
      "value": "4406"
    },
    {
      "text": "江门市",
      "value": "4407"
    },
    {
      "text": "湛江市",
      "value": "4408"
    },
    {
      "text": "茂名市",
      "value": "4409"
    },
    {
      "text": "肇庆市",
      "value": "4412"
    },
    {
      "text": "惠州市",
      "value": "4413"
    },
    {
      "text": "梅州市",
      "value": "4414"
    },
    {
      "text": "汕尾市",
      "value": "4415"
    },
    {
      "text": "河源市",
      "value": "4416"
    },
    {
      "text": "阳江市",
      "value": "4417"
    },
    {
      "text": "清远市",
      "value": "4418"
    },
    {
      "text": "东莞市",
      "value": "4419"
    },
    {
      "text": "中山市",
      "value": "4420"
    },
    {
      "text": "潮州市",
      "value": "4451"
    },
    {
      "text": "揭阳市",
      "value": "4452"
    },
    {
      "text": "云浮市",
      "value": "4453"
    }
  ],
  [{
      "text": "南宁市",
      "value": "4501"
    },
    {
      "text": "柳州市",
      "value": "4502"
    },
    {
      "text": "桂林市",
      "value": "4503"
    },
    {
      "text": "梧州市",
      "value": "4504"
    },
    {
      "text": "北海市",
      "value": "4505"
    },
    {
      "text": "防城港市",
      "value": "4506"
    },
    {
      "text": "钦州市",
      "value": "4507"
    },
    {
      "text": "贵港市",
      "value": "4508"
    },
    {
      "text": "玉林市",
      "value": "4509"
    },
    {
      "text": "百色市",
      "value": "4510"
    },
    {
      "text": "贺州市",
      "value": "4511"
    },
    {
      "text": "河池市",
      "value": "4512"
    },
    {
      "text": "来宾市",
      "value": "4513"
    },
    {
      "text": "崇左市",
      "value": "4514"
    }
  ],
  [{
      "text": "海口市",
      "value": "4601"
    },
    {
      "text": "三亚市",
      "value": "4602"
    },
    {
      "text": "三沙市",
      "value": "4603"
    },
    {
      "text": "儋州市",
      "value": "4604"
    },
    {
      "text": "省直辖县级行政区划",
      "value": "4690"
    }
  ],
  [{
      "text": "市辖区",
      "value": "5001"
    },
    {
      "text": "县",
      "value": "5002"
    }
  ],
  [{
      "text": "成都市",
      "value": "5101"
    },
    {
      "text": "自贡市",
      "value": "5103"
    },
    {
      "text": "攀枝花市",
      "value": "5104"
    },
    {
      "text": "泸州市",
      "value": "5105"
    },
    {
      "text": "德阳市",
      "value": "5106"
    },
    {
      "text": "绵阳市",
      "value": "5107"
    },
    {
      "text": "广元市",
      "value": "5108"
    },
    {
      "text": "遂宁市",
      "value": "5109"
    },
    {
      "text": "内江市",
      "value": "5110"
    },
    {
      "text": "乐山市",
      "value": "5111"
    },
    {
      "text": "南充市",
      "value": "5113"
    },
    {
      "text": "眉山市",
      "value": "5114"
    },
    {
      "text": "宜宾市",
      "value": "5115"
    },
    {
      "text": "广安市",
      "value": "5116"
    },
    {
      "text": "达州市",
      "value": "5117"
    },
    {
      "text": "雅安市",
      "value": "5118"
    },
    {
      "text": "巴中市",
      "value": "5119"
    },
    {
      "text": "资阳市",
      "value": "5120"
    },
    {
      "text": "阿坝藏族羌族自治州",
      "value": "5132"
    },
    {
      "text": "甘孜藏族自治州",
      "value": "5133"
    },
    {
      "text": "凉山彝族自治州",
      "value": "5134"
    }
  ],
  [{
      "text": "贵阳市",
      "value": "5201"
    },
    {
      "text": "六盘水市",
      "value": "5202"
    },
    {
      "text": "遵义市",
      "value": "5203"
    },
    {
      "text": "安顺市",
      "value": "5204"
    },
    {
      "text": "毕节市",
      "value": "5205"
    },
    {
      "text": "铜仁市",
      "value": "5206"
    },
    {
      "text": "黔西南布依族苗族自治州",
      "value": "5223"
    },
    {
      "text": "黔东南苗族侗族自治州",
      "value": "5226"
    },
    {
      "text": "黔南布依族苗族自治州",
      "value": "5227"
    }
  ],
  [{
      "text": "昆明市",
      "value": "5301"
    },
    {
      "text": "曲靖市",
      "value": "5303"
    },
    {
      "text": "玉溪市",
      "value": "5304"
    },
    {
      "text": "保山市",
      "value": "5305"
    },
    {
      "text": "昭通市",
      "value": "5306"
    },
    {
      "text": "丽江市",
      "value": "5307"
    },
    {
      "text": "普洱市",
      "value": "5308"
    },
    {
      "text": "临沧市",
      "value": "5309"
    },
    {
      "text": "楚雄彝族自治州",
      "value": "5323"
    },
    {
      "text": "红河哈尼族彝族自治州",
      "value": "5325"
    },
    {
      "text": "文山壮族苗族自治州",
      "value": "5326"
    },
    {
      "text": "西双版纳傣族自治州",
      "value": "5328"
    },
    {
      "text": "大理白族自治州",
      "value": "5329"
    },
    {
      "text": "德宏傣族景颇族自治州",
      "value": "5331"
    },
    {
      "text": "怒江傈僳族自治州",
      "value": "5333"
    },
    {
      "text": "迪庆藏族自治州",
      "value": "5334"
    }
  ],
  [{
      "text": "拉萨市",
      "value": "5401"
    },
    {
      "text": "日喀则市",
      "value": "5402"
    },
    {
      "text": "昌都市",
      "value": "5403"
    },
    {
      "text": "林芝市",
      "value": "5404"
    },
    {
      "text": "山南市",
      "value": "5405"
    },
    {
      "text": "那曲地区",
      "value": "5424"
    },
    {
      "text": "阿里地区",
      "value": "5425"
    }
  ],
  [{
      "text": "西安市",
      "value": "6101"
    },
    {
      "text": "铜川市",
      "value": "6102"
    },
    {
      "text": "宝鸡市",
      "value": "6103"
    },
    {
      "text": "咸阳市",
      "value": "6104"
    },
    {
      "text": "渭南市",
      "value": "6105"
    },
    {
      "text": "延安市",
      "value": "6106"
    },
    {
      "text": "汉中市",
      "value": "6107"
    },
    {
      "text": "榆林市",
      "value": "6108"
    },
    {
      "text": "安康市",
      "value": "6109"
    },
    {
      "text": "商洛市",
      "value": "6110"
    }
  ],
  [{
      "text": "兰州市",
      "value": "6201"
    },
    {
      "text": "嘉峪关市",
      "value": "6202"
    },
    {
      "text": "金昌市",
      "value": "6203"
    },
    {
      "text": "白银市",
      "value": "6204"
    },
    {
      "text": "天水市",
      "value": "6205"
    },
    {
      "text": "武威市",
      "value": "6206"
    },
    {
      "text": "张掖市",
      "value": "6207"
    },
    {
      "text": "平凉市",
      "value": "6208"
    },
    {
      "text": "酒泉市",
      "value": "6209"
    },
    {
      "text": "庆阳市",
      "value": "6210"
    },
    {
      "text": "定西市",
      "value": "6211"
    },
    {
      "text": "陇南市",
      "value": "6212"
    },
    {
      "text": "临夏回族自治州",
      "value": "6229"
    },
    {
      "text": "甘南藏族自治州",
      "value": "6230"
    }
  ],
  [{
      "text": "西宁市",
      "value": "6301"
    },
    {
      "text": "海东市",
      "value": "6302"
    },
    {
      "text": "海北藏族自治州",
      "value": "6322"
    },
    {
      "text": "黄南藏族自治州",
      "value": "6323"
    },
    {
      "text": "海南藏族自治州",
      "value": "6325"
    },
    {
      "text": "果洛藏族自治州",
      "value": "6326"
    },
    {
      "text": "玉树藏族自治州",
      "value": "6327"
    },
    {
      "text": "海西蒙古族藏族自治州",
      "value": "6328"
    }
  ],
  [{
      "text": "银川市",
      "value": "6401"
    },
    {
      "text": "石嘴山市",
      "value": "6402"
    },
    {
      "text": "吴忠市",
      "value": "6403"
    },
    {
      "text": "固原市",
      "value": "6404"
    },
    {
      "text": "中卫市",
      "value": "6405"
    }
  ],
  [{
      "text": "乌鲁木齐市",
      "value": "6501"
    },
    {
      "text": "克拉玛依市",
      "value": "6502"
    },
    {
      "text": "吐鲁番市",
      "value": "6504"
    },
    {
      "text": "哈密市",
      "value": "6505"
    },
    {
      "text": "昌吉回族自治州",
      "value": "6523"
    },
    {
      "text": "博尔塔拉蒙古自治州",
      "value": "6527"
    },
    {
      "text": "巴音郭楞蒙古自治州",
      "value": "6528"
    },
    {
      "text": "阿克苏地区",
      "value": "6529"
    },
    {
      "text": "克孜勒苏柯尔克孜自治州",
      "value": "6530"
    },
    {
      "text": "喀什地区",
      "value": "6531"
    },
    {
      "text": "和田地区",
      "value": "6532"
    },
    {
      "text": "伊犁哈萨克自治州",
      "value": "6540"
    },
    {
      "text": "塔城地区",
      "value": "6542"
    },
    {
      "text": "阿勒泰地区",
      "value": "6543"
    },
    {
      "text": "自治区直辖县级行政区划",
      "value": "6590"
    }
  ],
  [{
      "text": "台北",
      "value": "6601"
    },
    {
      "text": "高雄",
      "value": "6602"
    },
    {
      "text": "基隆",
      "value": "6603"
    },
    {
      "text": "台中",
      "value": "6604"
    },
    {
      "text": "台南",
      "value": "6605"
    },
    {
      "text": "新竹",
      "value": "6606"
    },
    {
      "text": "嘉义",
      "value": "6607"
    },
    {
      "text": "宜兰",
      "value": "6608"
    },
    {
      "text": "桃园",
      "value": "6609"
    },
    {
      "text": "苗栗",
      "value": "6610"
    },
    {
      "text": "彰化",
      "value": "6611"
    },
    {
      "text": "南投",
      "value": "6612"
    },
    {
      "text": "云林",
      "value": "6613"
    },
    {
      "text": "屏东",
      "value": "6614"
    },
    {
      "text": "台东",
      "value": "6615"
    },
    {
      "text": "花莲",
      "value": "6616"
    },
    {
      "text": "澎湖",
      "value": "6617"
    }
  ],
  [{
      "text": "香港岛",
      "value": "6701"
    },
    {
      "text": "九龙",
      "value": "6702"
    },
    {
      "text": "新界",
      "value": "6703"
    }
  ],
  [{
      "text": "澳门半岛",
      "value": "6801"
    },
    {
      "text": "氹仔岛",
      "value": "6802"
    },
    {
      "text": "路环岛",
      "value": "6803"
    },
    {
      "text": "路氹城",
      "value": "6804"
    }
  ]
]
export default cityData;
